package experiment9.exp1;

import com.hankcs.hanlp.HanLP;
import com.hankcs.hanlp.corpus.tag.Nature;
import com.hankcs.hanlp.model.crf.CRFLexicalAnalyzer;
import com.hankcs.hanlp.seg.CRF.CRFSegment;
import com.hankcs.hanlp.seg.Segment;
import com.hankcs.hanlp.seg.common.Term;

import java.io.IOException;
import java.util.List;

/**
 * CRF分词(在最新训练的未压缩100MB模型下，能够取得较好的效果，可以投入生产环境)
 *
 * @author hankcs
 */
public class DemoCRFSegment
{
    public static void main(String[] args) throws IOException {
        HanLP.Config.ShowTermNature = false;    // 关闭词性显示
        Segment segment = new CRFLexicalAnalyzer();
        String[] sentenceArray = new String[]
                {
                        "uid\tmid\ttime\tforward_count\tcomment_count\tlike_count\tcontent\n" +
                                "d38e9bed5d98110dc2489d0d1cac3c2a\t7d45833d9865727a88b960b0603c19f6\t2015-02-23 17:41:29\t0\t0\t0\t丽江旅游(sz002033)#股票##炒股##财经##理财##投资#推荐包赢股，盈利对半分成，不算本金，群：46251412\n" +
                                "fa13974743d3fe6ff40d21b872325e9e\t8169f1d45051e08ef213bf1106b1225d\t2015-02-14 12:49:58\t0\t0\t0\t#丁辰灵的红包#挣钱是一种能力，抢红包拼的是技术。我抢到了丁辰灵 和@阚洪岩 一起发出的现金红包，幸福感爆棚！情人节，一起来和粉丝红包约个会吧╮ (￣ 3￣) ╭http://t.cn/RZDIVjf\n" +
                                "da534fe87e7a52777bee5c30573ed5fd\t68cd0258c31c2c525f94febea2d9523b\t2015-03-31 13:58:06\t0\t0\t0\t淘宝网这些傻逼。。。气的劳资有火没地儿发~尼玛，你们都瞎了\n" +
                                "e06a22b7e065e559a1f0bf7841a85c51\t00b9f86b4915aedb7db943c54fd19d59\t2015-06-11 20:39:57\t0\t4\t3\t看点不能说的，你们都懂[笑cry]\n" +
                                "f9828598f9664d4e347ef2048ce17734\tc7f6f66044c0c5a3330e2c5371be6824\t2015-03-10 18:02:38\t0\t0\t0\t111多张\n" +
                                "d80f3d3c5c1d658e82b837a4dd1af849\tbfc0819b83ec59ce767287077f2b3507\t2015-02-13 01:09:41\t0\t0\t0\t有生之年！我最喜欢的up主跟我的三体勾搭到一起了！幸福感爆棚！ @黑桐谷歌  http://t.cn/RwGp4wk\n" +
                                "f349a67d1cd7c8683c5bbc5f8486e193\t83674a60e5310195fc35d97ea8f45c46\t2015-07-15 01:16:24\t0\t0\t0\t论优衣库试衣间隔音效果好坏？ http://t.cn/RL5aSzp（分享自 @知乎）\n" +
                                "24b621c98f2594b698c0b1d60c9ae6db\t2cbd3d514ed5ad3dab81aa043c8b3d0a\t2015-05-19 10:24:57\t0\t0\t0\t如此平凡的日常一幕，还能够再积累多少呢。 终有一天，当我们到了看着这张照片能感受到一阵怀念的年纪时，这份回忆将会伴随何种痛感呢。\n" +
                                "e44d81d630e4f382f657e72aa4b685da\t8a88a25f9f26ed9f79080eaacc1a8668\t2015-02-11 11:03:36\t0\t1\t0\t#罗永浩的红包#二十三，糖瓜儿粘，抢个红包乐翻天！我抢到了罗永浩 和@_王先森就是我 一起发出的小年大红包！羊年未到，好运先来~ [发红包]你也来试试手气~http://t.cn/RZgGwg6\n" +
                                "fbe6c953632e1b3dda66cf6118b6ab12\tf359a74cb4ac6150a3af8325eda04ea0\t2015-03-22 00:54:34\t0\t0\t0\t有好东西分享给你！闪记笔记记事，最好用的中文待办软件，还等什么？快去下载： http://t.cn/RPU97Dh\n" +
                                "f9a3ca6bc1e75d173cfc98ec4b108072\tc7bc3445e8b90db8cc5e045f606dc1ee\t2015-02-11 19:29:04\t21\t2\t6\thttp://t.cn/RwUFNuQ Microsoft Azure Machine Learning，用机器学习分析网络入侵日志的实例来练手。“大数据“在安全领域也开始炒得火热了，但大多数公开的报告都只是数据存储，数据传输、数据检索，数据可视化（攻击地图算是最多的），即使数据分析的成分也局限于类似TopN的描述性统计\n" +
                                "3c68bbb9da57fcc752c8a493d91bdd3a\t77e14cf9d460715e84c51747c3641a9b\t2015-04-28 00:14:05\t0\t0\t2\t#边走边唱#生命会有许多风雨让我们痛，但我们会在痛苦中成长，而且喜欢。[心]喜欢能有这样的世界，有乐也有痛；喜欢能有这样的灵魂，在千帆过后，开成一朵晨曦中的睡莲。周一的祝福，希望能带给你一周的正能量，晚安。[玫瑰] http://t.cn/RATFxmX\n" +
                                "104e8d55e98eb3cd834810088af039fe\tee0b2c9d35bfeb0fbc5b3a8677f4a18c\t2015-02-14 23:42:23\t9\t10\t15\t准备测第一批集群数据。\n" +
                                "0d15005d6397fb5ce1d45e7c834f7370\t9c954d63fcfea19dca8d81a4f3b53861\t2015-06-19 14:35:03\t0\t0\t0\t【蛋糕】1.奶油奶酪+黄油.牛奶拌匀;2.蛋黄打散+牛奶.面粉.糖拌匀;3.1和2混匀;4.蛋白+柠檬汁打发;5.预热电饭煲,舀一半蛋白到3中,上下拌匀入剩下蛋白中,翻拌匀;6.电饭煲内壁用黄油抹匀入4,半湿毛巾盖住出气口,焖10min开始煮5min,焖20min。\n" +
                                "875a4a77b339d93f819e2c4de5bd0b57\tf2cdcdbcec9ff47cbb3c6a636e4b92a3\t2015-07-01 04:11:48\t0\t0\t0\t#IT#【武汉一专车司机因毒驾被治安拘留】新华网武汉6月29日电(记者冯国栋)记者28日从武汉市公安局获悉，在日前一次执法检查中，一名专车司机被查出吸食麻果后驾驶。 http://t.cn/RLPRuoO\n" +
                                "380a2219670f50dc87efce3380bea6e8\t46f10244d02afa85d12346ce28e3cec5\t2015-03-11 08:00:24\t0\t0\t0\t【今年不管你做哪一行，都看看这篇文章】 http://t.cn/RwBO6Me（分享自 @新闻资讯）\n" +
                                "b9b88b0fc105fb08a552e782afa4342e\tcb907eb1bdbc198ed0944cc3b7e24f91\t2015-05-04 22:10:22\t0\t0\t0\t我分享了@励志这件小事 的文章 http://t.cn/RAuDfN7\n" +
                                "f18eb14365c0d7248fab1b9c464f4e70\t096543bd8746869982d1a7557164dd0d\t2015-02-18 21:37:17\t0\t0\t0\t#伊能靜的红包#挣钱是一种能力，抢红包拼的是技术。我抢到了伊能靜 和@支付宝钱包 一起发出的现金红包，羊年好运就此开启！你也来试试手气吧~╮ (￣ 3￣) ╭http://t.cn/RZkxyPd\n" +
                                "0fc17bf5e2dc789dd48505df1f5b14fd\t4c1e2418127811d212d0e3867a99db3e\t2015-07-13 05:07:28\t0\t0\t1\t羽田机场~~ http://t.cn/RLGJidL\n" +
                                "dd749a5af07c04ce7de451273a983671\t419dd71d562883ef836e774bc3f4e163\t2015-07-30 14:24:28\t0\t0\t0\t  分享了-KUTLUK-的歌单《Piano,奏响灵魂深处...》 http://t.cn/RLN5TII (来自@网易云音乐)\n" +
                                "a984551b159fcdc0a48f9e38ecb1488f\tbaa0051d359555601ab61df684787f0f\t2015-02-03 20:09:49\t0\t0\t0\t 分享专辑http://t.cn/RZs52s1（@网易云音乐）\n" +
                                "2e0467b73d0f6f9e5607a6174581fdd8\t2fd200a7f670138c2026091c3b01532a\t2015-04-15 15:49:11\t0\t0\t2\t看了这个问题一切明了了。最近真的就处在“进入保护模式，尽量帮他挡掉那些无聊琐碎的流程”的状态中啊！我就奇怪为何我在公司都已经开启自定义模式了……【如何应对桀骜不驯的优秀应届生？】一个雇员如果在一个公司牛逼到了出格的地步，只意味着一件事... http://t.cn/RAtt94x（分享自 @知乎）\n" +
                                "819656f05994b00b7260daf7346586a7\t95590e88cac5d8c9d1a496bc3bd42f07\t2015-05-27 14:50:18\t6\t1\t1\t搜狗实验室文本分类语料 http://t.cn/R2c1ocE\n" +
                                "91ce7c63b272f2037a3e702c10163fa3\t8b4e85a881afaff91f276eac7bfb6604\t2015-02-13 18:48:37\t0\t0\t0\t#稀酷客(随书光盘)#《Access 2007从入门到精通》.(创锐文化).[iso]@ckook-随书光盘-稀酷客本书是学习access 2007的入门读物。全书共分为16章，首先介绍了access办公软件和数据库的基本知识，为读者学习后面的内容打下基础；接着介绍了access中几类对象的基本创建 ... http://t.cn/Rw5vgdt\n" +
                                "4680e73f9e7a6b87dec62a86a7821c17\tb2db095af290b3a36cf798a3e17528d8\t2015-03-12 15:19:54\t0\t0\t0\t发表了博文《p2p网络理财平台菜鸟需要知道的网贷行业门道》同股票投资一样，p2p网络理财平台投资者也有大户及散户之分，顾名思义，大户，即手中有较大量资金，对平台重仓投资的投资者。散户，即对P2P平台投http://t.cn/RwdxSVX\n" +
                                "976e85e3ededdd9b2c2a3179eb7ae8ab\t9540ee0cf7ccfae523020c8025e7095f\t2015-03-21 22:04:55\t0\t0\t0\t慧聪网并购中关村在线的行业逻辑  （分享自 @TECH2IPO） http://t.cn/RAhdMg9\n" +
                                "6623347e5f19f35f2d02ad515b96524c\t9a2f48a870843d1964a03c6642b309d5\t2015-07-21 01:06:53\t0\t0\t0\t#糟蹋酒鬼菜#老板每次推荐完他们家的下酒菜，就会拼命的安利上等的酒……我每次都会妥协的喝两罐汽水。\n" +
                                "cf727e70b6661387cf6aadf01d2eb32c\tbff281350f035db0e84c25394865d86a\t2015-02-19 06:02:06\t0\t0\t0\t国内很落后在于 我曾经是做化工sensor的 别人以为我是医生 就是产业落后到老百姓不知道工程师是工程师 医生是医生 而且国内中科院都不具备开发复杂医疗器械的能力 我们联影是可以开发PET且便宜过西门子 但是创始人张强博士不是医生是电子工程师 很多人连我不在医院上班 而是曾经实习写代码都无法理解\n" +
                                "de0836c1c5d40a5cae64a964a0b54894\tc3345fd72cad53ca9bffd63634170ba0\t2015-04-20 22:36:23\t0\t0\t1\t分享@小輝at1989 的美拍 这位天王真的瘦了很多，去年QQ音乐到现在！But，你耍帅差点麦克风掉了是故意的吧??还好有接住，跟拍都没跟上你的Tempo，不过没有觉得一点尴尬，依旧帅帅的这样跳过去了??不愧是经过各种场面的巨星！ http://t.cn/RApU7Eu（通过 #美拍# 拍摄）\n" +
                                "c8848f18da5911d0389c3ac70fe13204\tfa352495e646a3f7ff979267c490fd89\t2015-06-11 23:46:08\t0\t0\t0\t冲着歌名就分享一下? 分享了赵照的单曲《回家吃饭》http://t.cn/R2l7VxP（@网易云音乐）\n" +
                                "5c1e6c9b61a4b279109b3a073f186fc9\t04af58a34efcdca88d14520e85fc15b7\t2015-07-24 21:32:43\t0\t7\t0\t用尽一生的情商。\n" +
                                "678939d41658af34419bc341f0a5e9f8\t8ce22d1f9521235bf1029f4378ef54b5\t2015-02-22 09:46:21\t0\t0\t0\t天涯一棵树，阅尽人生路，白发堪回首，绝境逢生处\n" +
                                "875a4a77b339d93f819e2c4de5bd0b57\tc95cf3c7207594728f4662a9441e91f9\t2015-05-13 02:58:26\t0\t0\t0\t#IT#【微商不是商业创新，只是渠道新增】不是他不想，而是有顾虑——珂兰钻石一直在进行新的资本合作，如果资本方要求创始团队必须继续回去做，将会无法和新创业团队和投资人交代。 http://t.cn/RAsxhpW\n" +
                                "cb5bfd1b44005f77d69083a7c6a0216d\t69364549231c747b44bac24d075b18be\t2015-02-25 14:42:04\t0\t0\t0\t#快的打车，就摇快乐#你以为今后打车都没有补贴了吗？赶快升级至最新版快的打车App，除夕至初七每天12点、19点，肾6和9000万代金券向你扑来！沾点喜气，快手领券：http://t.cn/Rwp4k4V\n" +
                                "100bdb8a475c638379fd7b774fd64c3b\t2be979269583cb3db82887c9eebebbb3\t2015-05-14 13:51:24\t0\t0\t0\t流程改革之后，你的领导有感觉吗？http://t.cn/R2PbYzH\n" +
                                "04d42b229a7843c17b3aa60fa18587ef\t6d10a87e850cc05010883aa7f0d36906\t2015-04-04 11:28:22\t0\t0\t0\t丫的还不让翻墙！[崩溃]\n" +
                                "5d445948d8e12b94a16d405dca8bb1a8\t858cfb614e04b500882b550d2bf462f7\t2015-06-03 01:48:58\t0\t0\t5\t我一直觉得“闲”是个没什么实际意义的词，因如果有人问“有没有空”，回答“有空”并不真的意味着有空，而是意味着“做这件事的收益大于做其他事的收益，因此我愿意把做其他事的时间用来做这件事”，也就是说提问者应该做好给予对方物质或情感回报的准备。很多事情这么想会方便很多。\n" +
                                "9946867fb7e729d3d7b5693ebe4274cd\t206984e28f1281a57e44a70b86b9b346\t2015-05-17 21:45:03\t0\t0\t0\t#武汉分享#经常熬夜热毒重经常熬夜之人，阴虚火旺，加上天气较热，外热引动内热，体内会蓄积很多热毒，多有口苦，眼睛经常发红，小便黄等表现。保健处方冬瓜、丝瓜性凉，有养阴清热的作用，可将冬瓜或丝瓜加入适量的水清炖，除加少量的盐之外，什么佐料都不用添加。\n" +
                                "2c90adbd87b526980c7882441d6c57c5\tc3c5109fb75809e76a6cf366669e1191\t2015-03-13 08:19:12\t0\t0\t0\t【华佗教你睡觉四个戒律：人很难变老】 (分享自 @今日头条 ) http://t.cn/RwgAZPh\n" +
                                "708747892b92bf38c7c232cc1e5ce3b0\t59f960d010ef39b7df715fc172b538f7\t2015-05-18 00:07:26\t0\t0\t0\ttomcat?è??http×?????×???https·??? – ??±????????? – 51CTO???????? http://t.cn/R2wIOzT\n" +
                                "fdf6066204a9de28e4ddd92b0744fcd6\ta16f2b1581bff7d2ae03d3c520ccb422\t2015-02-05 09:12:45\t0\t0\t0\t互联网常用场景下的大数据架构解析 http://t.cn/Rwv4FeI\n" +
                                "f0c9793d4f3673377225e1539143d309\t9e03bce9730e22bf2c5e3ae789ad5788\t2015-07-24 19:58:21\t0\t0\t0\t#支教实况#今天，华南农业大学ERP研究社三下乡已经到了尾声。经过了这十天来的培训，学生们的兴趣非但没有减少，比赛技术也越来越成熟了，他们的这份热情深深地打动着我们每一个人。我们三下乡团队也越来越和睦和有干劲，以至于看着这些学生的时候，心中难免有一种不舍得的伤感。@华农青年\n" +
                                "cf884f60c1e56f53532f51598e74fc7d\tdd87f48adf60e8469c6e9b9255fae16f\t2015-03-23 19:01:58\t0\t0\t0\t分享图片\n" +
                                "fba5207003ea8f5d30b7e448ca648f6e\tfd75d378230221a688180a8e75534541\t2015-04-21 03:35:16\t0\t0\t0\t发表了一篇转载博文《[转载]许一力：此次大幅降准的真相》http://t.cn/RAWaYyk\n" +
                                "5e0accb724040b282d3f1e159e59f3ba\t8434abda4f3c91ce3f734b3acb8d790d\t2015-04-26 09:17:26\t0\t0\t0\t窦唯“落魄”背后_娱乐频道_凤凰网 http://t.cn/RAHb3A3\n" +
                                "c3e1d1c689fed231c43920b255a3b327\t059793de2c094db59e86977a6d771f2f\t2015-02-13 13:30:46\t0\t0\t0\t槟子微报 http://t.cn/Rwqpkrg\n" +
                                "92cd2a6985d38d80d9d0e31af63df7a2\ta9e1197cb01de5c7dd97cf4d4c941610\t2015-07-31 21:06:01\t0\t2\t0\tgood. voice(通过 #唱吧#录制)。试听地址 >> http://t.cn/RLpDqg0\n" +
                                "8ecc11cb260150891301aa3c4c4caf2e\t956a1706506d3c094a7d29422042496f\t2015-02-15 01:39:46\t0\t0\t0\t#柯震東Kai的红包#挣钱是一种能力，抢红包拼的是技术。我抢到了柯震東Kai 和@PRO微整形 一起发出的现金红包，幸福感爆棚！情人节，一起来和粉丝红包约个会吧╮ (￣ 3￣) ╭http://t.cn/RZgOJmj\n" +
                                "f2c31ecf21ab64830a83fec5c2d06484\tbcb8f6f4529016b92bb4d08444c4230b\t2015-03-04 14:50:51\t0\t0\t0\t评论@半夏曲L 的博文【springMVC工作原理】：\"spring mvc demo教程源代码下载:http://t.cn/RP9nAHl\"查看原文：http://t.cn/zTYpRnA\n" +
                                "87895006f0dd91863e6501c482c17199\t38576e37e4b11791a3a7b2b53dc2aa70\t2015-03-30 10:41:05\t0\t0\t0\t @大梅_休息中 @lalalololee @防火门厂家123 @林少帆俱乐部 @ISSHI_一生片想 @丘會君 恭喜您-亲爱的用户，恭喜您成功成为“新浪.微博”确认为《七周年》场外活动二等奖幸运用户。请登陆:http://t.cn/RAbjIZn查收。[礼物]\n" +
                                "5e99ff5645b7f46ec62a76d1e05085a1\ta37001e133b996880cf38a8bc65a1eb9\t2015-04-11 23:49:39\t7\t0\t0\t由于一些不可抗因素（开发者业余时间），AOSC OS3 Beta 2 将跳票约 1 个月，新的发布时间请等待我们的通知。#aosc# @Linux中国 @Geeks在一中\n" +
                                "a11e89e28434a61df717311a2c288c6a\t92e37a2ced7c53dde4b84cb58016f5cc\t2015-06-08 20:34:59\t0\t0\t8\t这个世界太小了...不管怎么躲着，都能无意中和傻逼有交集[抠鼻屎][抠鼻屎][抠鼻屎]\n" +
                                "9bf024a6caba95e8d10d988c2656871c\t99ec27367a4c6778f7a839ff5b532660\t2015-07-16 01:14:13\t0\t0\t0\t我正在 #亚洲新歌榜# 为 @RAIN-JIHOON 的新歌 http://t.cn/RLGVd6U 打榜！好音乐需要用行动来支持，你也来为喜欢的歌曲加油吧！\n" +
                                "fb2b456982227210b0a5bbe021a966e3\t39911eea8f29d3ceb7e49ccd9d9f6c49\t2015-06-14 01:17:36\t0\t0\t0\t小时候，妈妈从山野摘回来几朵白色的花，插进装了清水的塑料瓶，弥漫一夏天。到现在才知道她们有一个好听的名字叫做，栀子花。\n" +
                                "7511e346911dd7d1e38f11485abb25c5\ta9d655c843af89e91b7e2d8a8afe10f8\t2015-07-15 23:52:01\t0\t0\t0\t【*Get started with functional programming in Python*】DownloadFunctionalProgramminginPython.Itishardtogetaconsistentopiniononjustwhatfunctionalprogrammingis,ev ...http://t.cn/RLtHLOc\n" +
                                "5113a9c738e42c711d580c2fa193f077\t665642aa736d9345ba043c7065dd1083\t2015-06-10 14:29:09\t0\t0\t0\t这两天手机市场很欢乐啊~[哈哈]\n" +
                                "3e61c298e33948cbd40b4bf160e1495b\tc344f34100fc408c259849d307e9f931\t2015-05-09 22:19:59\t2\t0\t0\t这是我看到过最有技术含量的一个段子.\n" +
                                "de2e1a224f8fdca7e294feb6754ff7f6\tfa64937246644917d9a1205bffb53dc3\t2015-02-09 19:36:07\t13\t20\t26\t做梦都想恢复曾经hadoop和hbase生态系统在我们手里的荣光，做梦都想做自己认为正确的事情，走正确的路\n" +
                                "ab94f6ef1cbb85717e2b9685fb47b676\t86d6607de4ab5432f9e0da3f30682f4a\t2015-07-17 10:44:36\t0\t0\t0\t墙掉PostGIS的，祝你们的后代没有PY。\n" +
                                "b6ac6266dc248823e9480429accc2a03\t20beda8066f134bf9cacea7a9ddd29ea\t2015-05-24 18:58:08\t0\t0\t0\t 分享单曲http://t.cn/R2q9Ktg（@网易云音乐）\n" +
                                "875a4a77b339d93f819e2c4de5bd0b57\tdc51c745b7013ca0413ad37f37353037\t2015-05-23 16:38:46\t0\t0\t0\t#IT#【美股评论：放弃电视苹果英明】导读：日前，有媒体报道称，苹果已经放弃了开发自己品牌电视机产品的努力，资深科技分析师道森(JanDawson)在MarketWatch撰文，指出了开发苹果电视机的经济账不合算，远不如继续开发Appl http://t.cn/R2GKr73\n" +
                                "a798520d72a0f7f9b42f5bc8397ac3bb\tc63e142bdc0d9eac71c28420bf5c8ba3\t2015-02-12 23:41:23\t0\t0\t0\t系统上线两个月运行不稳定，把能用的方法都试了一遍，效果依旧。请老人code review，发现是一个timeout参数引起。所以，最好的debug方法不是加一堆printf和gdb，而是认真审视一遍自己的代码。\n" +
                                "4dd5580dae554658482e94bbb5e39566\td43217978fec8013e25d91e4b33a46d8\t2015-02-12 17:29:35\t1\t1\t0\tangular-material 是一个惊天巨坑！\n" +
                                "573a74594ba8fa5de5f448153975bbf3\tb0ba629b4faa9d323fd01a7e1685d709\t2015-03-24 09:41:22\t0\t0\t0\t冬天爱上了夏天 合伙干掉了春天 一直徘徊在冬[拜拜][拜拜]\n" +
                                "923ec7bb174ddaf47feff6577b877460\tc18cad2c1bc75a5736e602b68771ac10\t2015-06-23 08:00:03\t1\t0\t0\t#物联网应用# 宣传周启动仪式上公布的《我国公众网络安全意识调查报告（2015）》显示，我国人民网络安全意识不容乐观。而与此类似，普通民众不太熟悉的工控信息安全形势亦不佳，甚至更加紧迫，因为它面临的不是个人的财产损失，而是可能涉及人身伤害或巨大社会、经济影响。http://t.cn/R2ucjZO\n" +
                                "5e1899782e3b6e73730b6efa10cffeb3\t01ef4ef87abb6d6e0b29e317a1d46133\t2015-06-10 20:10:44\t0\t0\t0\t听了之后整个人都不好了。。。看来我真的不懂艺术。。。\n" +
                                "26c2c166e9c19b68d3451467d4fccc97\t09a81f75fa17d095134f2457895eba00\t2015-02-19 02:00:56\t0\t0\t0\t#情人节，微博King被告白#挣钱是一种能力，抢红包拼的是技术。我抢到了@高洁丝官方微博 发出的现金红包，羊年好运就此开启！你也来试试手气~╮ (￣ 3￣) ╭http://t.cn/RZFOGWT\n" +
                                "a91d955eb55921171386353d97f26e2c\t9e7873120dcbf35ce3b7ff701aaf28f0\t2015-05-10 06:19:03\t1\t0\t2\t本来不再用微博的，已经好几天没看微博了，只是昨天早上5点多心里突然难受的厉害，就知道可能是之前喜欢的那个女的有事情，就看了看微博，发现她一夜没睡说自己极孤独，这和当时刚吵架时她删了我的qq，我就把她的微博微信都删了，那是她说了相似的话。\n" +
                                "1e8590546bfe040b5dba8c8b4f8fc03e\t760b2a3a87448ed90f260fd0e9e0d3e1\t2015-06-06 17:27:51\t0\t0\t0\t分享图片（阅读全文: http://t.cn/R291DHf 下载LOFTER客户端: http://t.cn/RPSYdQu）\n" +
                                "36a58fa61c3f342bc270e333b2f3235c\t5b90ad90258aa807b9070c28c6d3b272\t2015-04-04 21:49:26\t0\t0\t0\t#快的打车代金券# 看快乐大本营，iPhone、打车券摇不停！4月4日晚8点看快乐大本营，和TFBOYS、凤凰传奇一起摇5000万@快的打车 代金券！先领张券过过瘾？点击领取http://t.cn/RAfKTa8\n" +
                                "9a15786f6aaaf779eb941d2eba4a8988\t3ce0453454577d5e456cc9f142e50baa\t2015-07-23 12:18:27\t0\t0\t0\t关毅老师应该好好琢磨马伯庸先生所提的东西，最好把握神韵，不拘泥于此，我估计你不知道其中的玄妙\n" +
                                "c7c9db1b072790f2dbffc97b1c6c563b\t872026775288ec43bdb0fdadf1288c16\t2015-03-15 10:43:34\t1\t0\t0\t【视频】分享@夜薄小公主 的微录客：车上啪啪啪… （分享自 @vlook微录客）// 手快有,手慢无 http://t.cn/RwrxuwG\n" +
                                "cc11478b633300d3e3f18b0bedeb2fb3\t4daa5d6cbed5367e7fc6ada1dc57e6b1\t2015-04-15 08:08:19\t0\t0\t0\t不喜欢三星苹果？那用树莓派DIY一部手机好了   http://t.cn/RA9hm7a\n" +
                                "25142383d6e0964c18ef86f27c5572d4\tb7e581900c78d1fcf62a171bb8d3f695\t2015-02-25 12:33:17\t2\t0\t2\t2015/02/25 第151期：http://t.cn/RwpPmL0 风光无限的独角兽与低调的马。Raffi Krikorian访谈：关于Twitter的后台技术。给初次创业者的建议。在什么地方搞startup比较好？Youtube 10周年：一个Youtube明星的口述史。#湾区日报#\n" +
                                "3a19076b5f4c61a1f5525dbbd4899c03\tb32ed7a107aff47eb39d4700c31ab1ef\t2015-07-13 11:12:09\t0\t0\t0\t【沃尔玛内部曝光iPhone 6s售价 上调50美元】有外媒报道，在沃尔玛内部的备忘录文件中显示，新一代iPhone的零售价格相比iPhone 6将上调至少50美元。因此，16GB合约价从原本的199美元飙升至218美元，而64GB容量的Verizon两年合约机价格同样提高到了318美元。\n" +
                                "0faddeeabf8b2cfd75afc6ad9c1ba2da\t3a085da8d3e3380b5e5eb8b517ad2f66\t2015-04-01 17:26:25\t0\t0\t0\t采用RAID-5容错控制,使用三块500GB SATA硬盘用于存储音频节...http://t.cn/RA5j9Qs\n" +
                                "3841fcb8bdb3b5b4b8c4d94870b7bc1f\td87aed023098761ece0e0111dd09e081\t2015-03-25 22:18:05\t0\t0\t0\t#扇贝打卡# 第 139 天 学习了 100 个单词 http://t.cn/RA2rKrx\n" +
                                "92fadfe3830c9d363fe02de25a06c57b\t7b682dd0e0e7473d63f1483b6078de46\t2015-04-23 23:51:02\t0\t0\t1\t【弘子】绝对音感带你玩音游【Circuits】 UP主：弘子  #哔哩哔哩动画# http://t.cn/RAjnmAn\n" +
                                "c35d635cd9d875e63fcaff8e4f1398a9\t8a6d0ba389504acbabbdc8a5115bf3ea\t2015-04-26 20:00:51\t0\t0\t0\t【PM手册·范围管理】17个原则教你成为问卷&访谈高手。不能否认：经验丰富的设计师，不仅生活经验多，而且同理心强，能较好揣摩到用户心思，感知用户期望，即使用户研究做的少，也能找准需求，做出优秀设计。但问题设计的模糊、不准确会产生高达20%到30%的误差......[推荐]http://t.cn/RA9pYEp\n" +
                                "f5d4c4b896640c872d605f6a28190f04\t3dc67a120a7a151d183995e73bd1a122\t2015-04-26 13:18:26\t63\t2\t87\t成为全栈式工程师，往往不是他们自愿的，往往是被项目人力不足逼出来的。[偷笑]\n" +
                                "bb458a336992d0c3389eb416d1231f99\t28889be62f9e210b57ff2f2059d0fb48\t2015-07-23 13:46:57\t1\t0\t0\t阿里巴巴押宝云计算和大数据 试图在三年内赶超亚马逊-数智网 http://t.cn/RL6Ztmw\n" +
                                "c4b747dca344890718884e10805be401\tcc55cf3c808429f9909d9212d4dc24bc\t2015-04-19 08:22:19\t1\t0\t1\t#资源共享#【15个你会爱不释手的情人节矢量图形下载】http://t.cn/RZgyTcW  今天分享的礼物是15个你会爱不释手的情人节矢量图形下载，这些矢量图形都能用Adobe Illustrator等矢量工具打开，你可以将这些素材用于贺卡、活动促销专题和广告图设计等，而且这些素材无论是个人使用还是商用都是免费的！\n" +
                                "8d7a583279d6d442dd675c21424a2ce3\t37c8dc1d44e861dc5a1a9317cfe8b0ce\t2015-07-07 15:35:01\t0\t0\t0\t这鱼这么小，我都不想偷\n" +
                                "e9ffb38ff8a3c2dde380f2197fca3c91\tce9dfeca6cccbf74ecabbdd86fd09221\t2015-02-13 23:07:53\t0\t0\t0\t#田亮的红包#实在实在真实在！我在田亮 的粉丝红包中抽到了@快的打车 提供的“快的打车6元红包”，羊年未到，好运先来！你也快来试试手气~http://t.cn/RZgpsbI\n" +
                                "986fba709e35206b01371f5172025483\tc943f2784d6c9066bd5fefecf95c8f36\t2015-07-08 15:59:35\t0\t1\t1\t 分享单曲http://t.cn/RLLWmCC（@网易云音乐）\n" +
                                "485c0d465d608c94d5372d90a50ef21a\t93b726cf34fdbe41f790316a6ef7adb2\t2015-07-23 10:16:07\t0\t0\t0\t【VMware在数据中心内大行其道 第二财季表现出色】VMware公司日前公布了第二财季报告，其中每股收益超过金融分析师们的预期，但营收增长幅度却未能达到原定计划。 http://t.cn/RLiBKXt\n" +
                                "d38e9bed5d98110dc2489d0d1cac3c2a\t00755196c77936bf44656ada98291c59\t2015-07-13 19:24:50\t0\t0\t0\t想开了就是幸福，想不开就是痛苦…http://t.cn/RLqzYa1\n" +
                                "06fb6ad865dca45a038508bf5f98e4e8\t5fe9ccd8e82d7bfbfa9068f03a061a99\t2015-02-21 15:00:22\t0\t0\t0\t人生的三大悲：和憎恨的人生活在一起无法摆脱，你深爱的人离开了你，你很想得到的东西一直无法得到。拿得起，放得下，不强求，才能活出精彩。\n" +
                                "8904c3b3222402c458797048e3cb7dd8\t76d0225d5021059cf14d7f3ce17d7d6a\t2015-05-29 19:04:33\t0\t0\t0\t有点意思 http://t.cn/RAgWUvp\n" +
                                "d200e0c732e4ecc24c73da58b391a946\tcd4b36d565e440aecb256717223dbcb3\t2015-04-07 13:57:03\t2\t1\t0\t【三个应用案例——大数据挖掘潜在的威胁】大数据、大城市。世界已有不少大都会运用数据分析与算法建立智能城市，例如日本东京就把每辆车子都变成精准的「行动数据」，缓解交通堵塞甚至降低死亡车祸的数量,遏止未来可能发生的罪行甚至惨案。今天就让我们来看看三种应用案例：http://t.cn/RAxLyin\n" +
                                "c6d8dd4ec96e25a41fbb7535cd283a27\t1e0b7624060d3515684248f798d32f5b\t2015-03-19 20:20:12\t0\t0\t0\t堪误@新经典文库 @新经典文化 《番石榴飘香》根据文意，p47第一行第3个字“是”应该改为“有”。请再版时更正\n" +
                                "1a0e9fcfa14210fa36e77d12bcb824d0\te321d55d8a03a652d5a1f9d1d8345073\t2015-02-26 12:30:18\t0\t0\t0\t@OpenStack : Demo of Kubernetes on Openstack. http://t.cn/Rw0puon http://t.cn/Rw0puoE …http://t.cn/Rw0puih\n" +
                                "e5aeef1c1729faa12fec0bdf7b9b67e5\td0c69dc76ce6b4faebb45a5b44ae0db4\t2015-05-07 13:20:05\t0\t2\t1\t昨日午休时间我在整理快递单，期间剧烈咳嗽，对正在午睡的同事们感觉很抱歉。今天午休时间我决定不干活了，自己默默地离开工位躲进楼道里，想点事儿！接下来要干的事儿，咋干！先干哪个？拖延了那么久的事儿，啥时候能搞完？接下来的时间怎么安排？啊！！！好焦虑！！！[抓狂]\n" +
                                "1876d5b82e48ec1b97cb37110897f748\tf3b6fc37dbb714b4b9cfad07242eb38d\t2015-02-07 00:44:27\t1\t0\t2\t我觉得我要说的话太多了，自己都不觉得有那个智商说清楚[doge]再加上我是一个糙汉子[神兽] #李准0207生日快乐# 永远都是我的小王子的李昌宣，生日快乐?nothing better than you, my little prince?\n" +
                                "b31a0caa8e3ee8cbe23728fd8c1fdb5c\t10a16e80b908c3833f9e21baee4d69ee\t2015-06-16 10:56:59\t0\t0\t0\t学生票用不了了！还好今天天气不错[泪]\n" +
                                "0d0c6740d4fbdbaacbe6c0504ac1ef65\t51fcc0beec46151c4046cbaf713edd14\t2015-03-02 16:36:50\t0\t0\t0\t办公室太尼玛热了\n" +
                                "08035a4aaa71233ca510b14fb8288ef3\t1d979a10bf41e0d8651fcd266cfa152a\t2015-04-15 10:39:31\t7\t3\t6\tdeepin将于4月26日参加第五届“法理争鸣”法学专业辩论赛暨2015年版权专题辩论赛，该赛由湖北高校法学辩论联盟（简称“法辩盟”）和武汉市文化局（版权局）共同主办，有兴趣的小伙伴准备偶遇吧！[来][呵呵]\n" +
                                "0220afe08e008b01ad36cc916df43ace\t2dc66e7db0b4ae97738b63763b8a14af\t2015-03-15 08:01:24\t0\t0\t0\t#畅销书#当当畅销书第二名 解忧杂货店（《白夜行》 http://t.cn/Rw7xauO\n" +
                                "aca17ae1bb2b3ef544ccbe027251ff1f\t65bfa39eefede4e2c079bec732ae97ca\t2015-05-20 08:18:02\t0\t0\t0\t还打算在外面多玩会儿呢，一看排队过安检的人山人海，赶紧排队去，没想到昆明早上这么忙\n" +
                                "9c9a445713e4d51a907cf98012592482\t247ec787ef278a4089ec592d3d02da75\t2015-03-06 11:08:06\t2\t12\t7\t计算机音频术语中， Audio Endpoint 应该如何翻译? 有些地方把它翻译成 音频终结点，这这是。。。\n" +
                                "03d24f7424f40c20a83e695267989624\t41ca9408ecef515ce087334d5218df1f\t2015-05-31 11:50:11\t0\t0\t0\t铺上凉席过夏天\n" +
                                "0ff57f8377cabdf7342dca10250f1404\t022e4155fd66c308c0fb63680e3f092a\t2015-07-21 17:49:29\t0\t0\t0\t一起来玩蹦女神！\n" +
                                "969518aaf266b0f04da4ba21da880b1c\t60d7d805c1a986ca623f454ff6e1df65\t2015-06-25 11:31:23\t10\t0\t2\t【策划APP推广方案的好方法】APP版本又分为苹果iOS和谷歌Android两种类型，每个版本APP推广渠道都很多，记得几年前在松松博客上看到一篇介绍Android渠道的文章，光国内的分发渠道就几百个http://t.cn/R2gxtew\n" +
                                "427f285aa1f4226a9b393628897b9dcf\taa5a508beea4a202c52c755a893a86f3\t2015-04-26 09:36:01\t0\t0\t0\t#0CTF决赛#蓝莲花战队紧追不舍,和FlappyPig的比分越来越接近,二三名排位还是一大悬念呢。加油选手们,最终的胜利就在前方。@安全宝-蓝莲花\n" +
                                "ac4e754e41c3f328f1bf18c7fc381511\tb7bc985e6dc6a8d09b2d2a1d852cb9d8\t2015-02-25 21:00:03\t69\t7\t98\t【手写字】来自设计师Mark Van Leeuwen 的Hand Lettering励志名言，选一张你爱的作为手机壁纸激励自己吧！[赞]加油，2015！[给力]\n" +
                                "2b03e21e2f56ed6b3e78073bfce13c08\tbbdadf8ab9ba3447ee9041472fa6ad29\t2015-02-15 14:45:58\t0\t3\t1\t心血来潮 去看入行时的第一家公司的网页 发现里面还有当年我设计的东西在 瞬间。。。有那么点 傲娇？\n" +
                                "24c7e328ba6fcee5a746af8a108f791c\t73da532c0372b22d30b4eaa2bf8e5372\t2015-05-18 23:50:46\t0\t0\t0\t『Eric Brewer：容器和微服务是计算的未来 - 极客头条 - CSDN.NET』http://t.cn/R2wdtNB\n" +
                                "ed0732ba7c12aa879ec3901c5e0a8ca4\t32f96c7761393158319f465e2f6675e3\t2015-03-18 22:49:06\t0\t0\t3\t来吧 #呼风唤rain#",
                        "HanLP是由一系列模型与算法组成的Java工具包，目标是普及自然语言处理在生产环境中的应用。",
                        "鐵桿部隊憤怒情緒集結 馬英九腹背受敵",           // 繁体无压力
                        "馬英九回應連勝文“丐幫說”：稱黨內同志談話應謹慎",
                        "高锰酸钾，强氧化剂，紫红色晶体，可溶于水，遇乙醇即被还原。常用作消毒剂、水净化剂、氧化剂、漂白剂、毒气吸收剂、二氧化碳精制剂等。", // 专业名词有一定辨识能力
                        "《夜晚的骰子》通过描述浅草的舞女在暗夜中扔骰子的情景,寄托了作者对庶民生活区的情感",    // 非新闻语料
                        "这个像是真的[委屈]前面那个打扮太江户了，一点不上品...@hankcs",                       // 微博
                        "鼎泰丰的小笼一点味道也没有...每样都淡淡的...淡淡的，哪有食堂2A的好次",
                        "克里斯蒂娜·克罗尔说：不，我不是虎妈。我全家都热爱音乐，我也鼓励他们这么做。",
                        "今日APPS：Sago Mini Toolbox培养孩子动手能力",
                        "财政部副部长王保安调任国家统计局党组书记",
                        "2.34米男子娶1.53米女粉丝 称夫妻生活没问题",
                        "你看过穆赫兰道吗",
                        "乐视超级手机能否承载贾布斯的生态梦"
                };
        for (String sentence : sentenceArray)
        {
            List<Term> termList = segment.seg(sentence);
           /* for(Term x:termList){
                if(x.nature!= Nature.)
            }*/
            System.out.println(termList);
        }
    }
}